animalPositions = {
    -- {x,y,z, skinID, rot, name, maxHealth, autoStartAttack}
    {-2478.9013671875, -2172.029296875, 34.580654144287, 255, 257, "suportar", 200, true},   	
	{-2005.09765625, -2009.8056640625, 83.368499755859, 255, 321, "suportar", 200, true},
    {-1970.275390625, -2105.654296875, 78.30712890625, 256, 239, "raposa", 180, true},
    {-1898.2109375, -2150.14453125, 79.806755065918, 257, 246, "lobo", 180, true},
    {-1877.353515625, -2058.9697265625, 63.672618865967, 257, 354, "lobo", 180, true},
    {-1802.9150390625, -1956.2431640625, 93.458229064941, 255, 324, "suportar", 200, true},
    {-1640.4267578125, -1947.6787109375, 100.38505554199, 255, 33, "suportar", 200, true},
    {-1612.8427734375, -2063.1533203125, 54.269618988037, 256, 185, "raposa", 180, true},
    {-1382.9353027344, 1914.4699707031, 52.399795532227, 257, 45, "lobo", 200, true},
    {-1665.9287109375, -2162.0390625, 35.055553436279, 256, 154, "raposa", 180, true},
    {-1751.6982421875, -2305.99609375, 44.799221038818, 256, 98, "raposa", 180, true},
    {-1925.97265625, -2301.6943359375, 46.399047851562, 257, 43, "lobo", 180, true},
    {-1764.1494140625, -2475.20703125, 14.948535919189, 255, 224, "suportar", 200, true},
    {-1211.796875, 2002.5510253906, 134.6502532959, 255, 45, "suportar", 200, true},
    {-1638.009765625, -2614.2255859375, 46.71764755249, 255, 249, "suportar", 200, true},
    {-1431.498046875, -2632.91796875, 34.911056518555, 257, 262, "lobo", 180, true},
    {-1106.337890625, -2665.2841796875, 20.399068832397, 255, 245, "suportar", 200, true},
    {-1265.1455078125, -2253.8037109375, 22.17183303833, 256, 27, "raposa", 180, true},
    {-1386.4267578125, -2131.400390625, 25.550886154175, 257, 213, "lobo", 180, true},
    {-1088.248046875, -1414.7021484375, 128.57434082031, 256, 308, "raposa", 180, true},
    {-2863.4306640625, -1177.3447265625, 11.834278106689, 255, 104, "suportar", 200, true},
    {-2562.181640625, -946.2666015625, 18.858936309814, 256, 285, "raposa", 180, true},
    {-2408.669921875, -972.123046875, 15.64168548584, 257, 252, "lobo", 180, true},
    {-2282.4482421875, -1068.0126953125, 15.671875, 256, 59, "raposa", 180, true},
    {-2159.8994140625, -1168.884765625, 26.58667755127, 257, 52, "lobo", 180, true},
    {-191.87890625, -2707.94140625, 36.327953338623, 255, 342, "suportar", 200, true},

}
weaponDamages = {
    -- {weapon, damage}
	-- Ütő fegyverek
	{0, 1}, -- kéz
	{1, 2}, -- boxer
	{2, 2}, -- golfütő
	{3, 2}, -- gumibot
	{5, 2}, -- bézbózütő
	{6, 2}, -- lapát
	{7, 2}, -- dákó
	{4, 5}, -- kés
	{8, 10}, -- katana
	{9, 1}, -- láncfűrés
	-- pisztolyok
	{22, 10}, -- colt 45
	{23, 0}, -- hangtompítós
	{24, 15}, -- desert eagle
	-- Kis shotgun
	{25, 15}, -- shotgun
	{26, 15}, -- rövidcsövű
	{27, 15}, -- combat
	-- uzi meg ilyen szarok
	{28, 10}, -- uzi
	{28, 10}, -- tec9
	{28, 10}, -- mp5
	-- nagy kaliber
	{30, 20}, -- ak
	{31, 20}, -- m4
	-- vadász puska ilyenek
	{33, 40}, -- vadász
	{34, 35}, -- mesterlövész
	
	{35, 0}, -- mesterlövész
	{36, 0}, -- mesterlövész
	{37, 0}, -- mesterlövész
	{38, 0}, -- mesterlövész
	{16, 0}, -- mesterlövész
	{17, 0}, -- mesterlövész
	{18, 0}, -- mesterlövész
	{39, 0}, -- mesterlövész
}
maxDist = 25
maxInteract = 2
moneyElement = "money"
-- nagyBoxX, nagyBoxY, kisBoxX, kisBoxY
rectangleSize = {200,200, 180, 45}
animTexts = {
    {"...Você estende sua mão para o animal..."},
	{"...Você olha para o status dela..."},
	{"...O animal está morto..."},
	{"...Vira o animal..."},
	{"...Você tira a faca..."},
	{"...Você limpa sua faca..."},
	{"...Você começa a dissecar o animal..."},
	{"...Operações com facas..."},
	{"...Operações com facas..."},
	{"...Operações com facas..."},
	{"...Operações com facas..."},
	{"...Operações com facas..."},
	{"...Cortes finais..."},
	{"...Você está pronto para a tarefa..."},
}
itemReceivers = {
    --[skinID] = {bőrID, trófeaID, bőrPénz, trófeaPénz, "név"}
	[255] = {97, 100, 2000, 6000, "Urso"},
	--[255] = {97, 100, 2000, 6000, "Urso"},
	[256] = {98, 101, 4000, 10000, "raposa"},
	[257] = {99, 102, 6000, 16000, "lobo"},
}